package com.org.word;

public class Main {
    public static void main(String[] args) {
        new WordManager().start();
        /*
*** 영단어 마스터 ***
********************
1. 모든 단어 보기
2. 수준별 단어 보기
3. 단어 검색
4. 단어 추가
5. 단어 수정
6. 단어 삭제
7. 파일 저장
0. 나가기
********************
=> 원하는 메뉴는? 4
=> 난이도(1,2,3) & 새 단어 입력 : 1 driveway
뜻 입력 : 차고 진입로
새 단어가 단어장에 추가되었습니다 !!!
********************
1. 모든 단어 보기
2. 수준별 단어 보기
3. 단어 검색
4. 단어 추가
5. 단어 수정
6. 단어 삭제
7. 파일 저장
0. 나가기
********************
=> 원하는 메뉴는? 1
--------------------------------
1 * driveway 차고 진입로
--------------------------------
********************
1. 모든 단어 보기
2. 수준별 단어 보기
3. 단어 검색
4. 단어 추가
5. 단어 수정
6. 단어 삭제
7. 파일 저장
0. 나가기
********************
=> 원하는 메뉴는? 4
=> 난이도(1,2,3) & 새 단어 입력 : 2 graceful
뜻 입력 : 우아한
새 단어가 단어장에 추가되었습니다 !!!
********************
1. 모든 단어 보기
2. 수준별 단어 보기
3. 단어 검색
4. 단어 추가
5. 단어 수정
6. 단어 삭제
7. 파일 저장
0. 나가기
********************
=> 원하는 메뉴는? 1
--------------------------------
1 * driveway 차고 진입로
2 ** graceful 우아한
--------------------------------
********************
1. 모든 단어 보기
2. 수준별 단어 보기
3. 단어 검색
4. 단어 추가
5. 단어 수정
6. 단어 삭제
7. 파일 저장
0. 나가기
********************
=> 원하는 메뉴는? 0
프로그램 종료! 다음에 만나요~
 */
    }
}